Revit 2027 API
Railing.HasHost Property
 Indicates if the railing has a host.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasHost { get; }
Public ReadOnly Property HasHost As Boolean
	Get
public:
property bool HasHost {
	bool get ();
}
member HasHost : bool with get
Property Value
Boolean
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace